* STARTED Create git link type                                      :PROJECT:
   :LOGBOOK:
   CLOCK: [2009-10-01 Thu 17:20]--[2009-10-01 Thu 18:05] =>  0:45
   - Note taken on [2009-09-24 Thu 18:09] \\
     We also need to specify a method how to access the file: Either
     read-only via git show/cat-file or via git checkout (but this
     changes the working directory). Maybe have a method field like in
     tramp as well.
   - Note taken on [2009-09-24 Thu 18:07] \\
     We need to find a way to specify the Git dir, especially if the
     tracked directory has subdirectories.
   :END:
   
   Newsgroup entry which gave the idea:
  [[gnus:nntp%2Bnews.gmane.org:gmane.emacs.orgmode#200907241232.52729.torsten.wagner@googlemail.com][Email from Torsten Wagner: org-mode meets git a first pro]]

  Sometimes I need exactly that: A link to a file in a specific
  branch and at a specific version of a git repository. At the
  moment I am doing this by hand, e.g. in my xxx project
  file:
#+begin_EXAMPLE 
    Unser Anteil dazu im git Branch xxxantwort:
    [[file:~/misc/xxx-antrag/xxx-antrag.tex]]
#+end_EXAMPLE 
    Ideally we could simply create a link type which would then
    either =git-show= or =git-checkout= (or even =git-cat-file=)
    the specific file. =git-checkout= changes the working
    directory, which ist probably not what we want (you can
    always use =magit= or =vc-git= for that). Therefore,
    =git-show= is probably the best choice (see also the git FAQ
    entry). In the link need to specify
    - the git directory,
      [Aside: We need to handle bare repositories as well as
      normal working directories. If we specify the working
      directory, we need to actually pass the .git subdirectory
      to the git command. ]
    - the commit of the specific file version (HEAD by default),
    - the path to the file from GIT_DIR.

    
    One problem with this is that the commit can also contain one
    or more colons. Therefore the commit part should be the last
    part of the link. Another issue is to be as user friendly as
    possible for the default usage, which is saying: I want
    version such and such (or a particular branch) of this file.
    I therefore propose the following syntax:

** DONE Check out man pages of git-rev-parse 
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2009-07-24 Fri 17:08]
   CLOCK: [2009-07-24 Fri 16:55]--[2009-07-24 Fri 17:08] =>  0:13
   :END:
   Find out the possibilities to specify a file in a specific
   branch and version. See [[id:83573d86-8df3-4f56-9927-a917e4b62509][Specifying objects]].
** DONE Check whether attachments care about commits
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2009-07-24 Fri 15:56]
   CLOCK: [2009-07-24 Fri 15:54]--[2009-07-24 Fri 15:56] =>  0:02
   :END:
   No they don't. (Only creating their own commits). No help
   from there.
** DONE Find out how to create new link types 
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2009-07-24 Fri 15:54]
   CLOCK: [2009-07-24 Fri 15:46]--[2009-07-24 Fri 15:54] =>  0:08
   :END:
   See [[info:org:Adding%20hyperlink%20types][info:org:Adding hyperlink types]]
** DONE Find a way to get the specific xxx file mentioned above
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2009-07-24 Fri 15:45]
   CLOCK: [2009-07-24 Fri 15:30]--[2009-07-24 Fri 15:45] =>  0:15
   :END:
   =git show xxxantwort:xxx-antrag.tex= does the trick.
** DONE find out how to fill buffer with result of shell process     :ATTACH:
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2009-10-05 Mon 17:35]
   CLOCK: [2009-10-05 Mon 17:28]--[2009-10-05 Mon 17:35] =>  0:07
   CLOCK: [2009-10-01 Thu 16:30]--[2009-10-01 Thu 17:07] =>  0:37
   CLOCK: [2009-07-24 Fri 16:24]--[2009-07-24 Fri 17:03] =>  0:39
   CLOCK: [2009-07-24 Fri 15:58]--[2009-07-24 Fri 16:20] =>  0:22
   :END:
   :PROPERTIES:
   :Attachments: simple.el man.el org-git.el
   :ID:       19e759de-ea08-4848-9799-1303a5cc078f
   :END:
   Looking at simple.el (shell-command-on-region) and man.el
   (man) to find out how to call shell processes. Synchronous
   calling ist simpler. shell-command should simply work, though.
   I will simply use shell-command or call-process. Don't know
   whether we need a shell. Actually, I don't need to spawn a
   shell just to call git. Let's try =call-process=, see
   [[info:elisp:Synchronous%20Processes][info:elisp:Synchronous Processes]].

** DONE write test script executable from the shell
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2009-10-13 Tue 16:46]
   CLOCK: [2009-10-13 Tue 16:35]--[2009-10-13 Tue 16:46] =>  0:11
   :END:
   
** DONE Specify link syntax
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2009-10-07 Wed 14:40]
   - State "STARTED"    from "DONE"       [2009-10-07 Wed 14:24]
   CLOCK: [2009-10-07 Wed 14:24]--[2009-10-07 Wed 14:40] =>  0:16
   - State "DONE"       from "STARTED"    [2009-10-05 Mon 17:03]
   CLOCK: [2009-10-05 Mon 16:30]--[2009-10-05 Mon 17:03] =>  0:33
   :END:
*** DONE plan structure of git link and test file
    - Note taken on [2009-10-10 Sat 00:49] \\
      test is still failing because two subsequent links append to the buffer rather than delete first.
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2009-10-06 Tue 18:05]
   CLOCK: [2009-10-06 Tue 17:43]--[2009-10-06 Tue 18:04] =>  0:21
   CLOCK: [2009-10-05 Mon 17:51]--[2009-10-05 Mon 18:04] =>  0:13
   :END:
*** DONE implement bare git type
    :LOGBOOK:
    CLOCK: [2009-10-09 Fri 16:40]--[2009-10-09 Fri 17:46] =>  1:06
    CLOCK: [2009-10-09 Fri 15:35]--[2009-10-09 Fri 15:37] =>  0:02
    :END:
** DONE rewrite org-git-show link to use org-open-file
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2009-10-13 Tue 16:30]
   CLOCK: [2009-10-13 Tue 15:24]--[2009-10-13 Tue 16:30] =>  1:06
   - Note taken on [2009-10-12 Mon 16:59] \\
     branch savefile
   :END:
   This is so that external apps and internal image viewers are
   automatically called. We need a new specification for
   org-git-show and need to find a way to extract a filename from
   the commit (I think it is safe to restrict ourselves to file
   links). Unfortunately org-open-at-point does not return the
   buffer of the visited file (well it cannot, since it might be
   displayed in an external program). 
** DONE find way to extract filename from commit part
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2009-10-13 Tue 15:18]
   - State "STARTED"    from "DONE"       [2009-10-13 Tue 15:13]
   CLOCK: [2009-10-13 Tue 15:13]--[2009-10-13 Tue 15:18] =>  0:05
   - State "DONE"       from "STARTED"    [2009-10-12 Mon 17:50]
   CLOCK: [2009-10-12 Mon 17:32]--[2009-10-12 Mon 17:50] =>  0:18
   :END:
   - links to diffs (commits) might be useful too. Let's see how
     magit handles these. At the moment we focus on file names
   - symbolic ref names are probably of no use for permanent
     storage. We can ignore those (but can also use HEAD etc. as
     file names). They are part of the ref before the path anyway
   - [X] if the commit part is simply a sha1, we have no information.
         We can just take the sha as filename
   - [X] A special case of the above are commits specified by the
     beginning of the commit-message (e.g. of the form =git
     show :/Delete=). These are specified by a colon followed
     immediately by a slash. In this case we can use the search
     string as a filename.
   - [X] For our most important case (suffix colon followed by a
     path) we can simply extract the part after the colon and use 
     (file-name-nondirectory "lewis/foo") on that
   - [X] For a link to an index file in a merge (not very useful),
     taking the file name of the part after the last colon should
     again also work
** DONE rewriting history for private email address
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2009-10-09 Fri 16:39]
   CLOCK: [2009-10-09 Fri 16:25]--[2009-10-09 Fri 16:39] =>  0:14
   :END:
: git filter-branch --env-filter '
: export  GIT_AUTHOR_EMAIL="Reimar.Finken@gmx.de"
: export  GIT_COMMITTER_EMAIL="Reimar.Finken@gmx.de"
: '
** DONE Decide whether to write to a buffer or to a temporary file
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2009-10-13 Tue 15:20]
   CLOCK: [2009-10-07 Wed 14:41]--[2009-10-07 Wed 15:00] =>  0:19
   :END:
   I don't know whether one can view e.g. images (.png) directly
   in an emacs buffer. To my knowledge only temporary files are
   treated according to auto-mode-alist. In branch savefile I
   will use temporary files, which are then opened with org-open-file.
   later and first go with the temorary buffer route.
